#Bitwise operators
a=60 #0011 1100    
b=13 #0000 1101
c=0  #0000 0000

#AND เปรียบเทียบแต่ละบิด  จะได้1เมื่อบิตทั้งสองด้านเป็น 1
c = a & b #12 = 0000 1100
print(c)

#OR เปรียบเทียบแต่ละบิด  จะได้1ถ้าบิตฝั่งใดฝั่งหนึ่งเป็น 1
c = a | b #61 = 0011 1101
print(c)

#XOR เปรียบเทียบถ้าบิตทั้งสองไม่เหมือนกัน ได้ค่าเป็น 1
c = a ^ b #49 = 0011 0001
print(c)

#NOT กลับค่า0เป็น1 1เป็น0 
c = ~a #-61 = 1100 0011
print(c)

#Shift Left  เป็นการขยับบิตไปทางซ้าย ตำแหน่งที่ขยับเท่ากับการคูณ2
c = a<< 2 #240 = 1111 0000
print(c)

#Shift Right เป็นการขยับบิตไปทางขวา เท่ากับการหารด้วย 2 ไม่เอาเศษ
c = a >> 1  #15 = 0000 1111
print(c)