print("โปรแกรมคำนวนค่าผ่าทางมอเตอร์เวย์")
print("-"*50)
print("รถยนต์         4 ล้อ     กด 1 ") 
print("รถยนต์         6 ล้อ     กด 2 ")
print("รถยนต์มากกว่า   6 ล้อ     กด 3 ")
type1=["ลาดกระบัง --> บางบ่อ   30 บาท",
       "ลาดกระบัง --> บางประกง 45 บาท",
       "ลาดกระบัง --> พนัสนิคม  60  บาท",
       "ลาดกระบัง --> บ้านบึง    100  บาท",
       "ลาดกระบัง --> บางพระ   120  บาท"]
type2=["ลาดกระบัง --> บางบ่อ  45  บาท",
       "ลาดกระบัง --> บางประกง  75  บาท",
       "ลาดกระบัง --> พนัสนิคม  90  บาท",
       "ลาดกระบัง --> บ้านบึง    100  บาท",
       "ลาดกระบัง --> บางพระ  160  บาท"]
type3=["ลาดกระบัง --> บางบ่อ  70  บาท",
       "ลาดกระบัง --> บางประกง 110  บาท",
       "ลาดกระบัง --> พนัสนิคม  130  บาท",
       "ลาดกระบัง --> บ้านบึง    140  บาท",
       "ลาดกระบัง --> บางพระ  190  บาท"]
typecar = int(input("เลือกประเภทยานภาหนะ"))
i=[type1,type2,type3]
x=(typecar)-1
print(f"{i[x][0]}")
print(f"{i[x][1]}")
print(f"{i[x][2]}")
print(f"{i[x][3]}")
print(f"{i[x][4]}")